In [2]:
import pandas as pd

In [3]:
path = 'data1.csv'

In [5]:
path

'data1.csv'

In [6]:
df=pd.read_csv(path, encoding = 'cp949')

In [8]:
df

     구분    상세구분    미취학   초등학생    중학생   고등학생  대학교 및 대학원
0   시군별      시부  16.07  35.74  37.77  36.90      20.45
1   시군별      군부  12.53  25.85  35.89  27.02      13.74
2    성별      남자  15.68  35.26  39.11  35.85      21.31
3    성별      여자  13.66  28.82  28.34  31.57      11.58
4   연령별  15~19세    NaN    NaN    NaN    NaN        NaN
5   연령별  20~29세   9.98   6.08   0.00    NaN       0.00
6   연령별  30~39세  16.36  33.36  27.91  18.92       0.00
7   연령별  40~49세  15.76  36.99  40.82  37.36      11.32
8   연령별  50~59세  12.77  19.33  28.13  36.16      22.99
9   연령별  60세 이상   9.14  15.13  28.33  12.31      29.28
10  학력별      무학  27.55  34.28   1.92  11.64      55.17
11  학력별    초등학교   8.44  15.35  25.60  10.84       0.00
12  학력별     중학교   6.05  20.14  24.75  13.41      55.55
13  학력별    고등학교  13.40  29.05  29.34  31.00      13.22
14  학력별      대학  15.76  33.87  33.71  37.72       9.95
15  학력별     대학교  18.20  41.60  53.00  46.75      35.85
16  학력별     대학원  17.98  57.63  51.99  43.87      16.26

In [10]:
df.head()

    구분    상세구분    미취학   초등학생    중학생   고등학생  대학교 및 대학원
0  시군별      시부  16.07  35.74  37.77  36.90      20.45
1  시군별      군부  12.53  25.85  35.89  27.02      13.74
2   성별      남자  15.68  35.26  39.11  35.85      21.31
3   성별      여자  13.66  28.82  28.34  31.57      11.58
4  연령별  15~19세    NaN    NaN    NaN    NaN        NaN

In [12]:
df.tail

<bound method NDFrame.tail of      구분    상세구분    미취학   초등학생    중학생   고등학생  대학교 및 대학원
0   시군별      시부  16.07  35.74  37.77  36.90      20.45
1   시군별      군부  12.53  25.85  35.89  27.02      13.74
2    성별      남자  15.68  35.26  39.11  35.85      21.31
3    성별      여자  13.66  28.82  28.34  31.57      11.58
4   연령별  15~19세    NaN    NaN    NaN    NaN        NaN
5   연령별  20~29세   9.98   6.08   0.00    NaN       0.00
6   연령별  30~39세  16.36  33.36  27.91  18.92       0.00
7   연령별  40~49세  15.76  36.99  40.82  37.36      11.32
8   연령별  50~59세  12.77  19.33  28.13  36.16      22.99
9   연령별  60세 이상   9.14  15.13  28.33  12.31      29.28
10  학력별      무학  27.55  34.28   1.92  11.64      55.17
11  학력별    초등학교   8.44  15.35  25.60  10.84       0.00
12  학력별     중학교   6.05  20.14  24.75  13.41      55.55
13  학력별    고등학교  13.40  29.05  29.34  31.00      13.22
14  학력별      대학  15.76  33.87  33.71  37.72       9.95
15  학력별     대학교  18.20  41.60  53.00  46.75      35.85
16  학력별     대학원  17.98  57.63  51.99  43.87      16.26>

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 7 columns):
구분           17 non-null object
상세구분         17 non-null object
미취학          16 non-null float64
초등학생         16 non-null float64
중학생          16 non-null float64
고등학생         15 non-null float64
대학교 및 대학원    16 non-null float64
dtypes: float64(5), object(2)
memory usage: 1.1+ KB

In [17]:
df.shape

(17, 7)

In [21]:
df.sample()

    구분 상세구분    미취학   초등학생    중학생   고등학생  대학교 및 대학원
1  시군별   군부  12.53  25.85  35.89  27.02      13.74

In [23]:
df.columns

Index(['구분', '상세구분', '미취학', '초등학생', '중학생', '고등학생', '대학교 및 대학원'], dtype='object')

In [25]:
df.dtypes

구분            object
상세구분          object
미취학          float64
초등학생         float64
중학생          float64
고등학생         float64
대학교 및 대학원    float64
dtype: object

In [31]:
null_count=df.isnull().sum()

In [32]:
null_count

구분           0
상세구분         0
미취학          1
초등학생         1
중학생          1
고등학생         2
대학교 및 대학원    1
dtype: int64

In [33]:
df_null_count = null_count.reset_index()

In [34]:
df_null_count

       index  0
0         구분  0
1       상세구분  0
2        미취학  1
3       초등학생  1
4        중학생  1
5       고등학생  2
6  대학교 및 대학원  1

In [36]:
df_null_count.columns=['메뉴', '결측']

In [38]:
df_null_count_3 = df_null_count.sort_values(by='결측',ascending=False).head(3)

In [40]:
drop_columns = df_null_count_3['메뉴']

In [42]:
drop_columns.to_list()

['고등학생', '미취학', '초등학생']

In [44]:
df[drop_columns]

     고등학생    미취학   초등학생
0   36.90  16.07  35.74
1   27.02  12.53  25.85
2   35.85  15.68  35.26
3   31.57  13.66  28.82
4     NaN    NaN    NaN
5     NaN   9.98   6.08
6   18.92  16.36  33.36
7   37.36  15.76  36.99
8   36.16  12.77  19.33
9   12.31   9.14  15.13
10  11.64  27.55  34.28
11  10.84   8.44  15.35
12  13.41   6.05  20.14
13  31.00  13.40  29.05
14  37.72  15.76  33.87
15  46.75  18.20  41.60
16  43.87  17.98  57.63

In [46]:
print(df.shape)

(17, 7)

In [55]:
df=df.drop(drop_columns, axis=1)

KeyError: "['고등학생' '미취학' '초등학생'] not found in axis"

In [56]:
df

     구분    상세구분    중학생  대학교 및 대학원
0   시군별      시부  37.77      20.45
1   시군별      군부  35.89      13.74
2    성별      남자  39.11      21.31
3    성별      여자  28.34      11.58
4   연령별  15~19세    NaN        NaN
5   연령별  20~29세   0.00       0.00
6   연령별  30~39세  27.91       0.00
7   연령별  40~49세  40.82      11.32
8   연령별  50~59세  28.13      22.99
9   연령별  60세 이상  28.33      29.28
10  학력별      무학   1.92      55.17
11  학력별    초등학교  25.60       0.00
12  학력별     중학교  24.75      55.55
13  학력별    고등학교  29.34      13.22
14  학력별      대학  33.71       9.95
15  학력별     대학교  53.00      35.85
16  학력별     대학원  51.99      16.26

In [50]:
print(df.shape)

(17, 4)

In [57]:
df.head(10)

    구분    상세구분    중학생  대학교 및 대학원
0  시군별      시부  37.77      20.45
1  시군별      군부  35.89      13.74
2   성별      남자  39.11      21.31
3   성별      여자  28.34      11.58
4  연령별  15~19세    NaN        NaN
5  연령별  20~29세   0.00       0.00
6  연령별  30~39세  27.91       0.00
7  연령별  40~49세  40.82      11.32
8  연령별  50~59세  28.13      22.99
9  연령별  60세 이상  28.33      29.28

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 4 columns):
구분           17 non-null object
상세구분         17 non-null object
중학생          16 non-null float64
대학교 및 대학원    16 non-null float64
dtypes: float64(2), object(2)
memory usage: 672.0+ bytes